Repository: 84000/data-translation-memory
Catalog: toh431-v1.tmx
Source language: bo
Languages: en

source: སྡིག་པའི་ནད་ལ་སོགས་པ་ལ་རྨ་བྱའི་སྒྲོ་ལ་རང་གི་སྔགས་ཀྱིས་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་ནས་བྱ་བ་བར་བྱའོ། །
en: “Having incanted a peacock’s feather with 108 recitations of one’s personal mantra, one should brush the place affected by a bad disease or sickness.

source: ཆེ་གེ་མོའི་ཆེ་གེ་རོ་ག་ནཱ་ཤ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Destroy such and such disease of such and such a person!

source: ནད་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །
en: There will be an appeasement of all ailments.

source: ལྷ་སྦྱིན་གྱི་བི་ཥ་ནཱ་ཤ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Destroy the poison in such and such!

source: དེ་བཞིན་དུ་གང་གི་དབང་དུ་བྱ་བ་ལ་ནི་རང་གི་གནས་ནས་འོངས་ཏེ་གཅེར་བུ་སྐྲ་གྲོལ་བ་མདུན་དུ་བསམས་ཏེ་
en: “Likewise one should contemplate a person who is one’s target as enthralled, being at one’s service, paying a visit at one’s own place, naked, with disheveled hair, in front of oneself.

source: འགྱེལ་བར་བལྟས་ནས་བཟླས་པས་དབང་དུ་འགྱུར་རོ། །
en: Visualizing him as fallen to one’s feet, one should recite the mantra. Then the enthrallment will take place.

source: ཆེ་གེ་མོ་བདག་གི་བ་ཤ་མཱ་ན་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Bring such and such to the state of enthrallment!

source: དེ་བཞིན་དུ་སྔོན་མ་བཞིན་དུ་དགུག་པར་བསམས་ནས་བཟླས་པས་འགུགས་པར་བྱེད་དོ། །
en: “In the same way as before, one should recite the mantra while contemplating him as being drawn toward oneself. The target will be brought into one’s presence.

source: ཆེ་གེ་མོ་ཨཱ་ཀརྵ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Draw such and such into my presence!

source: བདག་ལ་པུཥྚིཾ་ཀུ་རུ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Bring prosperity to me!

source: སྔགས་འདིས་གྲུ་གསུམ་གཉིས་ཁ་སྦྱར་ཏེ། དབུས་སུ་གོ་ལའི་འདབ་མ་ལ་ཚེར་མས་བྲིས་ཏེ། །
en: “One should write this mantra with a thorn on a betel leaf, in the center of a space delimited by two intersecting triangles,

source: ཕོ་བ་རིས་ལྔ་དང་བཅས་པའི་གོ་ལ་ཟོས་ནས།
en: and chew the betel together with five grains of black pepper.

source: སརྦ་ཛྭ་རྃ་ནཱ་ཤ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Destroy all the fevers!

source: རིམས་ཐམས་ཅད་འཇོམས་པར་བྱེད་དོ། །
en: ‘Destroy all the fevers!’

source: ཟླ་བ་གཟས་བཟུང་བའམ། ཉི་མ་གཟས་བཟུང་བ་ལ།
en: “At the time of a lunar or solar eclipse,

source: འོ་མའི་ཟན་ནམ་ཞོའི་ཟན་གྱིས་ལྷུང་བཟེད་བཀང་ནས།
en: one should fill a bowl with rice cooked with milk or curd,

source: ཀར་དང་མར་དང་བཅས་པ།
en: adding sugar and clarified butter.

source: ཨ་ཤྭད་ཐའི་ལོ་མ་བདུན་གྱི་སྟེང་དུ་བཞག་ནས།
en: One should place that on top of seven leaves from the bodhi tree and

source: ལོ་མ་བདུན་གྱིས་སྟེང་ནས་གཡོགས་ཏེ།
en: cover it with another seven leaves.

source: ལག་པ་གཉིས་ཀྱིས་བརྟེན་ནས།
en: Holding it up with both hands,

source: ཇི་སྲིད་མ་གྲོལ་གྱི་བར་དེ་སྲིད་བཟླས་པར་བྱའོ། །
en: one should recite the mantra for as long as one is not liberated.

source: དེ་ཟོས་པས་ལོ་ལྔ་བརྒྱ་ཐུབ་བོ། །
en: By eating it, one will live for five hundred years.

source: རིམ་པ་འདི་ཉིད་ཀྱིས་བ་བླ་འམ། གི་ཝང་ངམ། ལྡོང་རོས་སམ། སླང་དྲེག་ལ་བསྒྲུབ་པར་བྱའོ། །
en: “Following the same procedure, one should imbue with efficaciousness yellow orpiment, the pigment of bovine gallstones, realgar, or lampblack.

source: འབར་བར་གྱུར་ན་ཐིག་ལེ་འམ། །མིག་སྨན་གྱི་རིག་པ་འཛིན་པར་འགྱུར་རོ། །
en: If it bursts into flames, one will become a vidyādhara by applying it as a tilaka on one’s forehead or an ointment.

source: དུ་བ་བྱུང་ན་མི་སྣང་བར་འགྱུར་རོ། །
en: If it produces smoke, one will attain invisibility.

source: དྲོ་བར་གྱུར་ན་དབང་དུ་བྱེད་དོ།
en: If it releases heat, an enthrallment will take place.

source: ནཱ་ག་གེ་སར་གྱི་ཤིང་གི་རང་བཞིན་ལ་ཀླུའི་རྒྱལ་པོ་མཐའ་ཡས་བྱའོ། །
en: make, from the wood of cobra’s saffron, the king of nāgas, Ananta.

source: དེ་ཆུའི་ནང་དུ་ཁ་ཐུར་དུ་བསྟན་ནས།
en: Having submerged him, face down, in water,

source: གདོང་ནམ་མཁར་བལྟས་ནས་བཟླས་པ་བྱའོ
en: one should recite the mantra while looking into the sky.

source: ཧ་ན་ཧ་ན་ཨ་ནནྟྃ་ཤི་གྷྲྃ་པཪྵ་པ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should employ the mantra: ‘ Seize Ananta, seize! Cause him to send rain!

source: ལྷ་ཡིས་ཆར་འབེབས་སོ། །
en: The god will then send rain.

source: དེ་ནས་མཐའ་ཡས་ཆུ་ནས་བཏོན་ཏེ།
en: “Then one should take Ananta out of the water,

source: འོ་མ་ཡིས་ཁྲུས་བྱས་ནས་གཤེགས་སུ་གསོལ་བར་བྱའོ། །
en: bathe him in milk, and release him.

source: དེ་ནས་སྤྲིན་ལ་རྣམ་པར་བལྟས་ནས་བཟླས་པར་བྱའོ། །
en: Then, gazing at the clouds, one should recite the mantra.

source: སརྦ་བཱ་ཏ་པྲྀཥྚི་སྟམྦྷ་ཡ་ཞེས་སྦྱར་བར་བྱའོ། །
en: One should add the mantra: ‘ Stop all the wind and rain!

source: ཆར་རེངས་པར་འགྱུར་རོ། །
en: ‘Stop all the wind and rain!’

source: དེ་བཞིན་དུ་གཉིས་པ་དང་གསུམ་པའི་རྩ་བའི་སྔགས་དག་གི་ཆོ་ག་དང་།
en: These rites belong also to the second and third root mantras.

source: སྙིང་པོའི་སྔགས་ཀྱི་ཡང་ཆོ་ག་འདི་ཉིད་དོ།
en: And only these rites belong to the heart mantras.

source: དང་པོར་ཕྲེང་བའི་སྔགས་ཀེ་ཏ་ཀིའི་ལོ་མ་ལ་ཚེར་མས་བྲིས་ནས།
en: “One should write the first garland mantra with a thorn on an umbrella tree leaf and

source: གོས་སྔོན་པོ་དང་སྐུད་པ་དག་གིས་དཀྲིས་ནས་
en: wrap it using blue cloth and blue string.

source: ཀྲོ་དྷ་ཙེ་ཏཾ་སཱཾ་ཆེ་གེ་མོ་ཛྲ་རྃ་ནཱ་ཤ་ཡ་ཞེས་པ་འདི་བྱས་པས་
en: With my angry mind, I will destroy the fever of such and such a person.

source: འཆིང་བའི་དུས་སུ་ནད་པ་གདོང་ཤར་དུ་ཕྱོགས་པར་བྱས་ནས།
en: “At the time of tying the amulet, one should make the sick person face east and

source: ཉ་བསྲེགས་པ་དང་ཟན་དང་ཆང་ལ་སོགས་པས་གང་བའི་ཁམ་ཕོར་གྱིས་སྦྱངས་ནས།
en: lustrate him with a bowl full of grilled fish, rice, wine, and so forth.

source: འདི་ཟོལ་རིམས་ལ་སོགས་པ་ཐམས་ཅད་མྱུར་དུ་ཕྱིར་དེངས་ཤིག །
en: One should say, ‘After eating this, may all fevers and diseases quickly go away.

source: བཅོམ་ལྡན་འདས་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་བཀའ་འདི་ཉིད་ཀྱིས་སོང་ཤིག །
en: Lord Caṇḍa­mahā­roṣaṇa is ordering this.

source: གལ་ཏེ་ན་ཡང་གཞན་དུ་མི་འགྲོ་ན། །
en: If you don’t go away,

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་གཏུམ་པོ་ཁྲོས་པའི་རལ་གྲིས་ཏིལ་གྱི་ཚད་ཙམ་དུ་གཏུབ་པར་བྱའོ་
en: then the lord, angered, will chop you up with a sharp sword into smithereens as small as sesame seeds.’

source: ཞེས་བརྗོད་ནས།
en: After saying this,

source: བདེན་བྲལ་གྱི་མཚམས་སུ་གཏང་བར་བྱའོ། །
en: one should offer an oblation in the southwestern quarter.

source: དེ་ནས་བདེ་བར་འགྱུར་རོ། །
en: will then become well.

source: དེ་བཞིན་དུ་ནད་དང་མཁའ་འགྲོ་མ་དང་། བར་དུ་གཅོད་པ་ཐམས་ཅད་ལ་གཏོར་མ་སྦྱིན་པར་བྱའོ། །
en: “In the same way, an oblation should be offered in the event of any disease, attacks by ḍākinīs, or other misfortunes.

source: འཇིགས་པ་ཐམས་ཅད་ལ་བཀླགས་པ་ཙམ་གྱིས་སྲུང་བར་བྱེད་དོ། །
en: One effects protection from all types of fear merely by reciting the mantra.

source: གཞན་ཡང་རྩ་བའི་སྔགས་བརྗོད་པས་ཐམས་ཅད་བྱེད་དོ། །
en: Moreover, saying the root mantra will accomplish all.

source: ཕྲེང་བའི་སྔགས་གཉིས་པ་ལ་ཡང་ཆོ་ག་འདི་ཉིད་དོ། །
en: Only this ritual belongs to the second garland mantra.

source: ཕྲེང་བའི་སྔགས་གསུམ་པས་ལྷག་མའི་ཆད་པུ་ལ་མངོན་པར་བསྔགས་ནས་སྦྱིན་པར་བྱའོ། །
en: “One should incant a cake of leftovers with the third garland mantra and offer it.

source: མཆོག་སྟེར་བར་འགྱུར་རོ། །
en: This will bring fulfillment of wishes.

source: ཟན་གྱི་ཕུང་པོ་ལ་མངོན་པར་བསྔགས་ནས།
en: One should incant a cake of rice and

source: ཕྱི་དྲོའི་དུས་སུ་དབེན་པའི་ཕྱོགས་སུ་སྦྱིན་པར་བྱའོ། །
en: offer it at evening twilight in a secluded place.

source: བྱ་བ་གང་གི་ཕྱོགས་ལ་དེས་ཐམས་ཅད་འགྲུབ་བོ། །
en: Then any objective one aims for will be accomplished.

source: ཆོ་ག་ལྷག་མ་ནི་སྔོན་མ་བཞིན་ནོ། །
en: The remaining part of the ritual is as before.

source: ཆོ་ག་སྔོན་མ་བཞིན་དུ་
en: Following the method previously described,

source: དཀར་པོའི་ཚེས་གཅིག་ནས་བརྩམས་ཏེ་ཇི་སྲིད་ཉ་གང་བའི་བར་སྔོན་བཞིན་དུ་བྱའོ། །
en: one should start on the first day of the bright fortnight and proceed as before until the day of the full moon.

source: ཕྲེང་བའི་སྔགས་རྣམས་ཀྱི་སྟོང་ཕྲག་བཅུས་སྔོན་དུ་བསྙེན་པ་བྱའོ། །
en: “The preliminary practice is completed with ten thousand recitations of the garland mantras.

source: ལྷ་རྣམས་ཀྱི་བྱེ་བྲག་གི་སྔགས་རྣམས་རྩ་བའི་སྔགས་ཀྱི་ཆོ་ག་བཞིན་དུའོ། །
en: These rites, as was the case with the rites belonging to the root mantra, call for deity-specific mantras.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྔགས་ཀྱིས་ཆོ་ག་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: Just as the mantra rituals of the lord are to be performed,

source: དེ་བཞིན་དུ་ལྷ་མོ་རྣམས་ཀྱིའོ། །
en: so also are they to be performed for the goddesses.

source: ཁྱད་པར་དུ་ཕྲེང་བའི་སྔགས་བཟླས་པས། སྙན་དང་གས་མཁན་དང་པཎྜི་ཏ་ཉིད་དུ་མྱུར་དུ་འགྱུར་རོ། །
en: In particular, through reciting, poetic and scholarly skills will quickly arise.

source: རྩ་བའི་སྔགས་གསུམ་པའི་ཆོ་གའོ། །
en: “Now comes the ritual involving the third root mantra.

source: མལ་གྱི་སྟེང་དུ་ལག་པ་གཡོན་པས་ལིང་ག་བཟུང་ནས་བརྒྱ་རྩ་བརྒྱད་བཟླས་པར་བྱའོ། །
en: One should climb on to one’s bed and, holding one’s penis with the left hand, recite 108 times.

source: གང་གི་མིང་གང་ཡིན་པ་དེ་འོང་བར་བྱེད་དེ་འདོད་པར་བྱའོ། །
en: Whoever’s name one includes in the mantra, she will arrive. One should make love to her.

source: གང་གི་མིང་ཡིན་པ་དེ་འོང་བར་འགྱུར་རོ། །
en: Whoever’s name one includes in the mantra, she will arrive.

source: སྔགས་ནི།
en: The mantra to recite is:

source: ཨོྃ་བོོ་ཧ་རི་ཆེ་གེ་མོ་མེ་ཨཱ་ཡཱ་ཏུ་ཧཱུྃ་ཕཊ། །
en: Oṁ , Vauherī, may such and such come to me! Hūṁ phaṭ

source: ཡུངས་ཀར་ལ་ལན་བདུན་དུ་མངོན་པར་བསྔགས་ནས་སྐྱེས་བུ་ལ་བསྣུན་པར་བྱའོ། །
en: “One should incant mustard seeds seven times and strike a person with them;

source: ནད་དང་བྲལ་བར་འགྱུར་རོ། །
en: he will become free from disease.

source: ཡིད་ཀྱིས་བརྟག་པར་བྱའོ། །
en: One can also perform this mentally.

source: ཆུ་ལ་ཡོངས་སུ་བཟླས་ནས་བསྣུན་ན་ཁྲག་འཛག་པར་འགྱུར་རོ། །
en: Having incanted water, one should strike; blood will flow.

source: གོས་ལ་ཡོངས་སུ་བཟླས་ནས་
en: Having incanted clothes,

source: སྐྱེ་བོ་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ། །
en: one will become dear to all people.

source: བ་ལང་གི་སྤུའི་ཐག་པ་སྔགས་ཀྱིས་མངོན་པར་བསྔགས་ནས་གང་གི་མགུལ་དུ་བཅིངས་པ་དེ་
en: Any person into whose food or drink one puts incanted salt will become enthralled. “Any person around whose neck one ties a rope made of cow’s hair, having first incanted this rope,

source: བ་ལང་དུ་འགྱུར་རོ། །
en: will become a cow.

source: ཉི་མ་ལ་མངོན་པར་ཕྱོགས་ནས་གང་གི་མིང་ནས་མངོན་པར་བཟླས་པ་དེ་འོང་བར་འགྱུར་རོ། །
en: Whoever’s name one recites while facing the sun, one will bring that person into one’s presence.

source: ཞུམ་བུའི་སྤུའི་ཐག་པ་གང་གི་མགུལ་པར་བཅིངས་པ་དེ་ཞུམ་བུར་འགྱུར་རོ། །
en: Any person around whose neck one ties a rope made of cat’s hair will become a cat.

source: བྱ་རོག་གི་རྒྱུས་པའི་སྲད་བུས་བྱ་རོག་ཏུ་འགྱུར་རོ། །
en: By using a rope made of crow’s sinews, that person will become a crow.

source: སྐྱེས་བུའི་སྐྲའི་སྲད་བུས་སྐྱེས་བུར་འགྱུར་རོ། །བུད་མེད་ཀྱི་སྐྲའི་སྲད་བུས་བུད་མེད་དུ་འགྱུར་རོ། །
en: With a rope of man’s hair, a woman will become a man. With a rope of woman’s hair, a man will become a woman.

source: དེ་བཞིན་དུ་གང་དང་གང་གི་སྤུ་ལ་སོགས་པའི་སྲད་བུས་བྱས་པས་དེ་དང་དེའི་གཟུགས་ཉིད་དུ་འགྱུར་རོ། །
en: “In this way, with whoever’s hair the rope is made, the target will turn into that respective form.

source: གང་གི་མིང་གིས་བཟླས་ན་དེའི་ཁྲག་འགུགས་སོ། །
en: Whoever’s name one should recite, one will draw that person’s blood.

source: མིག་མི་འཛུམས་པར་བལྟ་ཞིང་འདི་བཟླས་པས་དེ་དབང་དུ་འགྱུར་རོ། །
en: Whoever one looks at with unblinking eyes while reciting the mantra, that person will become enthralled.

source: ཞེས་པ་ནི་ལྷ་མོའི་སྔགས་ཀྱི་ཆོ་གའོ། །
en: “These were the rites belonging to the mantra of the goddess.

source: གཏོར་མའི་སྔགས་ཀྱིས་གཏོར་མ་དབུལ་བར་བྱའོ། །
en: “One should offer an oblation with the oblation mantra.

source: ནད་དང་བགེགས་ལ་སོགས་པའི་བར་དུ་གཅོད་པ་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །
en: All the obstacles in the form of calamities, disease, and the like, will be pacified.

source: གཏོར་མ་ཕུལ་ནས་བྱ་བ་གང་ལ་ཞུགས་ན།
en: In whatever endeavor one may be involved, one should offer an oblation,

source: དེ་འགྲུབ་པར་འགྱུར་རོ། །
en: and one will succeed in it.

source: མེ་ཏོག་དཀར་པོའི་ཁམ་ཕོར་དང་། འོ་མའི་ཁམ་ཕོར་དང་། དྲི་བཟངས་ཀྱི་ཆུའི་ཁམ་ཕོར་དང་། ཞོ་ཟན་གྱི་ཁམ་ཕོར་ཏེ།
en: A bowl with white flowers, another one with milk, another with perfumed water, and another with rice

source: ཁམ་ཕོར་བཞི་པོ་འདི་རྣམས་ཤིང་ཐོག་དང་ཉེ་བའི་ཤིང་ཐོག་གིས་
en: —these four bowls and an offering of the main and auxiliary fruits

source: རབ་ཏུ་ཞི་བའི་མཚན་མོ། །
en: in the quiet of the night

source: བརྒྱ་རྩ་བརྒྱད་བསྔགས་ནས་
en: by reciting 108 times,

source: ཨོྃ་ཙཎྜ་མ་ཧཱ་རོ་ཥ་ཎ་ཨི་མྃ་བ་ལིཾ་གྲྀཧྞ་གྲྀཧྞ་བདག་གི་བྱ་བ་ཆེ་གེ་མོ་སྒྲུབས་ཤིག་ཧཱུྃ་ཕཊ།
en: Oṁ , Caṇḍa­mahā­roṣaṇa, take this oblation, take! Accomplish my task! Hūṃ phaṭ

source: འདོད་པ་འགྲུབ་བོ།། །།
en: One’s wishes will come true.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྩ་བའི་སྔགས་བརྒྱ་རྩ་བརྒྱད་བརྒྱད་བཟླས་ནས།
en: “Then, with 108 recitations of the root mantra of the lord,

source: སྦྲུམ་མའི་བྷ་གའི་ནང་དུ་
en: inside the bhaga of a pregnant woman

source: འཐུངས་ན་ཡང་རབ་ཏུ་བདེ་བ་སྐྱེ་བར་འགྱུར་རོ། །
en: make her drink it. She will give birth with ease.

source: དེ་བཞིན་དུ་འདིས་རྨ་ལ་བྱུགས་ན་ཡང་བདེ་བར་འགྱུར་རོ། །ཟོས་པས་ཀྱང་ཐམས་ཅད་དུའོ། །
en: By dressing a wound with this oil alone, the wound will heal. All these things can also be achieved by ingesting this oil.

source: དང་པོར་ཕྲེང་བའི་སྔགས་ཀྱིས་གྲོ་ག་ལ་ཆུ་སྐྱེས་འདབ་མ་བཅུ་དྲུག་པའི་དབུས་སུ་བྲི་བར་བྱའོ། །
en: “One should write the first garland mantra on birch bark, in the center of a sixteen-petaled lotus.

source: སྲད་བུ་སྔོན་པོས་དཀྲིས་ནས་ལུས་ལ་བཅིངས་ན་
en: One should wrap it with a blue cord and wear it on one’s body.

source: གི་ཝང་ངམ་རྒྱ་སྐྱེགས་ཀྱིས་བྲི་བར་བྱའོ། །
en: One should write the mantra with the pigment of bovine gallstones or red lac.

source: དེ་བཞིན་དུ་རྒྱུད་གཞན་དུ་གསུངས་པའི་ཆོ་ག་ཡང་འདི་ཉིད་ཀྱི་སྦྱོར་བས་སྦྱར་བར་བྱའོ། །
en: So also can the methods described in other tantras and practice manuals be employed here.

source: རྣལ་འབྱོར་པས་བསྒོམས་པའི་མཐུ་ཡིས་དེ་བཞིན་དུ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: In the same way, all endeavors of a yogin, who relies on meditative cultivation, will be successful.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས། སྔགས་ཀྱི་ཆོ་ག་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་གཉིས་པའོ།། །
en: Thus concludes the chapter on all the rites involving mantras, twelfth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: རྣལ་འབྱོར་སྡོམ་པས་གང་གིས་གཞག །
en: “What conduct should be followed by a yogin?

source: སྤྱོད་པའི་ཚུལ་ཡང་ཅི་འདྲ་ཞིག །
en: And what practice ought to be done?

source: སངས་རྒྱས་བསྟན་པ་སུན་འབྱིན་པའི། །ངེས་པར་གདུག་ཅན་གསད་པར་བྱ། །
en: “Killed should be the evil ones— Those who disparage the Buddha’s teaching.

source: དེ་རྣམས་ཉིད་ཀྱི་ནོར་བླངས་ནས། །སེམས་ཅན་རྣམས་ལ་ཕན་ཕྱིར་སྤྱད། །
en: Having seized their wealth, One should perform the benefit of beings.

source: ཡུགས་ས་མོ་ཀུན་ངེས་པར་བསྟེན། །
en: “All widows should indeed be attended upon;

source: ཤ་དང་ཉ་ཤ་བཟའ་བར་བྱ། །
en: One should consume fish and meat,

source: མཉམ་བཞག་ནས་ནི་ཆང་ནི་བཏུང་། །
en: And drink wine, in a state of mental equilibrium.

source: སྦས་པ་རབ་སྦྱོར་ཉིད་ལས་འགྲུབ། །
en: Will succeed by applying this secret discipline.

source: གང་གང་སྡིག་པ་དེ་ཉིད་ཀྱིས། །
en: “By whatever wickedness

source: སེམས་ཅན་རྣམས་ནི་འོག་ཏུ་འགྲོ། །
en: Beings go to lower states of existence,

source: དེ་ནས་བཅོམ་ལྡན་འདས་མ་ཞེ་སྡང་རྡོ་རྗེ་མས་བཅོམ་ལྡན་འདས་ལ་འདི་ཉིད་གསོལ་ཏོ།
en: The goddess Hatred Vajrī then asked the lord,

source: བཅོམ་ལྡན་འདས་ཁྱོད་ཀྱིས་ཇི་ལྟར་སྡོམ་པ་ཕྱིན་ཅི་ལོག་ཏུ་གསུངས།
en: “How, O lord, would you explain the inverted conduct?”

source: མེས་ཚིག་པ་ལ་མེ་ཡིས་བདུག །འདོད་ཆགས་ཀྱིས་བསྣུན་འདོད་ཆགས་ཀྱིས། །
en: “By passion, passion is killed; A conflagration is killed by fire.

source: དུག་གིས་བསྣུན་ལ་དུག་ཉིད་ཀྱིས། །ཐབས་ནི་རབ་ཏུ་སྦྱོར་ལས་སོ། །
en: One should destroy poison with poison, Applying the instructions.

source: བདག་གི་དངོས་གྲུབ་ཅེས་བསྒོམ་པ། །
en: Cultivating the thought, ‘I am an accomplished one,’

source: ཤིན་ཏུ་སྦས་པ་ཀུན་ནས་སྤྱད། །སུས་ཀྱང་ཇི་ལྟར་མི་ཤེས་བྱ། །
en: One should keep all one’s practice very secret, So that nobody knows.

source: སྡིག་པ་ཐམས་ཅད་ཟད་བྱས་ནས། །
en: “Having extinguished all one’s negativity,

source: ཕྱིན་ཅི་ལོག་གིས་འདི་ཉིད་འགྲུབ། །
en: One succeeds by means of the inverted conduct alone.

source: རྣལ་འབྱོར་དེ་ཉིད་གཅིག་སྦྱོར་མཆོག །གང་ཞིག་སྦེད་པར་མི་བྱེད་ན། །
en: A yogin, solely devoted to yoga, Who does not keep it secret,

source: སྡོམ་པ་ཕྱིན་ཅི་ལོག་འདི་ཡི། །དེ་ཡི་དངོས་གྲུབ་ཡོད་མ་ཡིན། །
en: “Will not have success In this inverted conduct.

source: བདག་གིས་གསལ་པོར་མ་བྱས་སོ། །
en: I have not disclosed this

source: ད་ནི་བདེན་པར་གསུང་མཛད་པ། །
en: Only now do I teach it in truth,

source: གཏུམ་པོའི་ཚུལ་གྱིས་དགའ་མ་ཀྱེ། །
en: In the form of Caṇḍa­mahā­roṣaṇa, O beloved.

source: ད་ནི་དགའ་མ་ཁྱོད་ཉོན་ཅིག །
en: Listen now, O beloved!

source: སྲོག་ཆགས་གསད་པར་མི་བྱ་ཞིང་། །ཕ་རོལ་ནོར་ནི་འཕྲོག་མི་བྱ། །
en: “One should not kill living beings Or take another’s property.

source: བློ་ལྡན་ཆང་ནི་བཏུང་མི་བྱ། །
en: A wise one should never drink wine.

source: མགོ་བོ་ལ་ནི་དབུ་རྒྱན་བྱ། །
en: One should place a diadem on one’s head

source: རྣ་བདག་ལ་རྣ་རྒྱན་ནོ། །
en: And a pair of earrings on one’s ears.

source: རྐང་པ་དག་ལ་རྐང་གདུབ་བོ། །
en: Anklets should be placed around one’s ankles,

source: དེ་བཞིན་རྐེད་པ་རྐེད་རྒྱན་ནོ།
en: And likewise a girdle around one’s waist.

source: ལག་གཡས་རལ་གྲི་དང་། །གཡོན་དུ་ཞགས་པ་གཟུང་བར་བྱ། །
en: “In one’s right hand, one should hold a sword; In the left, a noose.

source: སངས་རྒྱས་ལྔ་ནི་རབ་སྦྱོར་བས། །མགོ་བོ་དབུ་རྒྱན་ཕྱག་རྒྱ་བྱ། །
en: On the head, a crown-seal should be placed, Representing the five buddhas.

source: ཟུར་ཕུད་ལྔ་ཡིས་བརྒྱན་བྱས་ནས། །སྐྲ་དང་ཁ་སྤུ་བྲེག་པར་བྱ།
en: “One should attach to one’s head the five strips of colored cloth And shave off one’s hair and beard.

source: སྔོན་གསུངས་རིགས་ཀྱི་དབྱེ་བ་ཡིས། །གཞོན་ནུ་མ་རྣམས་རབ་ཏུ་བརྟག །
en: “One should prepare this girl According to the previously explained division of families.

source: བུ་མོ་ལ་འོས་རྒྱན་གྱིས་ནི། །རྟག་ཏུ་ཡང་ནི་བརྒྱན་པར་བྱ། །
en: One should always bedeck her with adornments Suitable for a girl.

source: གཡས་པར་གྲི་གུག་སྦྱིན་བྱ་ཞིང་། །གཡོན་པ་རུ་ཡང་ཀ་པཱ་ལ། །
en: “One should place in her right hand a kartri knife, And in the left, a skull cup.

source: རིགས་ཀྱི་དབྱེ་བས་ངེས་པར་བྱ། །ཁ་དོག་དབྱེ་བས་ལུས་ལའོ། །
en: A paramour of a select category should arrange such requisites On his partner’s body according to the division of families.

source: རང་རིགས་ཤེས་རབ་གཟུང་བྱས་ནས། །ཡང་ན་གཞན་རིགས་མཉམ་བཞག་ནས། །
en: “One should take a wisdom-consort from one’s own spiritual family, Or any other spiritual family, keeping a focused mind.

source: རང་འདོད་ཡང་དག་བཟུང་ནས་ནི། །སྤྱོད་པ་འདི་ནི་ཡང་དག་བརྩམ། །
en: One should collect the objects of worship as one wishes And commence the practice itself.

source: རིན་ཆེན་ལ་སོགས་མེད་གྱུར་ན། །
en: “In the absence of jewels and the like,

source: གལ་ཏེ་རབ་འཇུག་མ་རྙེད་ན། །ཡང་ན་སེམས་ཀྱིས་བསྒྲུབ་པར་བྱ། །
en: Alternatively one should create things mentally If they cannot be physically obtained.

source: རིགས་ལྔའི་རབ་ཏུ་དབྱེ་བ་ལས། །དམ་ཚིག་ལྔ་ལ་སྤྱད་པར་བྱ། །
en: “One should practice the five pledges According to the fivefold family division.

source: དེ་ནི་སྔོན་གསུངས་སྦྱོར་བ་ཡིས། །
en: Using the method as previously described,

source: འདིར་ནི་བྱ་བ་གཞན་མི་བརྩམ། །རྣམ་ཀུན་རྣལ་འབྱོར་དངོས་གྲུབ་ཐོབ། །
en: “The yogin will succeed in every way;

source: ཡིག་གསུམ་སེན་མོ་སྦྱིན་པར་བྱ། །
en: One should scratch her and inscribe the three syllables.

source: འོ་དང་འཁྱུད་པ་ཉིད་དང་ནི། །
en: “One should give kisses and embraces,

source: སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་རྫོགས་པར། །དེ་ཉིད་ཐེ་ཚོམ་མེད་པར་འགྱུར། །
en: The perfection of giving becomes thus fulfilled— There is no doubt.

source: ལུས་ངག་ཡིད་ནི་དེ་མཆོག་ཏུ། །བདེ་བས་ཡང་དག་སྡོམ་པ་ནི། །
en: “One’s body, speech, and mind wholly engaged And controlled in concordance with one’s intense pleasure—

source: ཚུལ་ཁྲིམས་ཕ་རོལ་ཕྱིན་ཞེས་བྱ། །
en: This should be known as the perfection of discipline.

source: སེན་མོ་གདབ་པ་བཟོད་པ་ཡིས། །
en: The nail-wound, patiently endured—

source: ཡི་གེ་གསུམ་གྱིས་བཅིར་བ་ཉིད། །
en: “The suffering of the inscribed three syllables—

source: འདི་ནི་བཟོད་པའི་ཕ་རོལ་ཕྱིན། །
en: This alone is the perfection of patience.

source: གུས་པ་དང་བཅས་དུས་རིང་དུ། །
en: With reverence and for a long time

source: བརྩོན་འགྲུས་ཕ་རོལ་ཕྱིན་ཞེས་བྱ། །
en: “This should be known as the perfection of diligence,

source: སེམས་ཉིད་བདེ་བ་དེ་སྦྱོར་ལས། །
en: Because of engaging one’s mind in the pleasure of it.

source: བསམ་གཏན་ཕ་རོལ་ཕྱིན་པར་འདོད། །
en: It is regarded as the perfection of concentration.

source: ཤེས་རབ་ཕ་རོལ་ཕྱིན་མར་གྲགས། །
en: This is proclaimed to be the perfection of wisdom

source: ཤིན་ཏུ་དགའ་ཅིག་སྦྱོར་ཙམ་གྱིས། །
en: Merely by this single method of exquisite pleasure,

source: ཕ་རོལ་ཕྱིན་པ་དྲུག་རྫོགས་འགྱུར། །
en: The six perfections become fulfilled.

source: ཕ་རོལ་ཕྱིན་ལྔ་བསོད་ནམས་དང་། །
en: “If the five perfections are merit,

source: ཤེས་རབ་ཡེ་ཤེས་ཞེས་བྱར་གསུངས། །
en: The knowledge is wisdom—so it is said.

source: ཤིན་ཏུ་དགའ་སྦྱོར་མཚུངས་ལྡན་པ། །
en: When united in the union of exquisite bliss,

source: བསོད་ནམས་ཡེ་ཤེས་དང་ལྡན་ན། །
en: “One who is endowed with merit and wisdom

source: སྐད་ཅིག་ཙམ་གྱིས་འགྲུབ་པར་འགྱུར། །
en: Will succeed in an instant,

source: དཔེར་ན་འཁྲི་ཤིང་ལས་བྱུང་བའི། །མེ་ཏོག་འབྲས་བུ་དང་ལྡན་ལྟར། །
en: Just like a fruit growing on a creeper Is endowed with a flower.

source: སྐད་ཅིག་གཅིག་གིས་རྫོགས་བྱང་ཆུབ། །
en: “A full awakening will happen within a moment

source: ཚོགས་གཉིས་ལས་ནི་ཡང་དག་བྱུང་། །
en: With the two accumulations already completed.

source: ས་ནི་བཅུ་གསུམ་དབང་ཕྱུག་ཏུ། །དེ་ནི་ཐེ་ཚོམ་མེད་པར་འགྱུར། །
en: One becomes master of the thirteen stages, There is no doubt.

source: ས་ནི་རབ་དགའ་ཞེས་བྱ་དང་། །
en: “The stages should be known as Joyful,

source: དྲི་མེད་དེ་བཞིན་འོད་བྱེད་དང་། །
en: Pure , Beacon of Light,

source: འོད་འཕྲོ་བ་དང་སྦྱང་དཀའ་དང་། །
en: Resplendent, Invincible,

source: མངོན་གྱུར་རིང་གྱུར་མི་གཡོ་བ། །
en: Facing Directly, Going Far, Immovable,

source: ལེགས་པའི་བློ་གྲོས་ཆོས་ཀྱི་སྤྲིན། །
en: “Auspicious Intelligence, Cloud of Dharma,

source: ཀུན་དུ་འོད་དང་
en: All Luminous,

source: བཅུ་གསུམ་ཞེས་བྱ་འདི་རྣམས་སོ།
en: These are the thirteen names.”

source: པའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས་སྤྱོད་པའི་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་གསུམ་པའོ།། །།
en: This concludes the chapter on practice, the thirteenth in the glorious tantra of Caṇḍa­mahā­roṣaṇa called “ The Sole Hero

source: དེ་ནས་འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱ་བའི་རྡོ་རྗེ་རྣལ་འབྱོར་པས།
en: Then in that gathering, a vajra yogin called Samantabhadra

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: said this to the Blessed One,

source: མགོན་པོ་ལ་ནི་བདག་ཞུའོ། །
en: “May I ask, O lord,

source: ཅི་ཕྱིར་མི་གཡོ་བ་ཞེས་བྱ། །དཔའ་བོ་གཅིག་ཉིད་ཅེས་བྱ་དང་། །
en: why do we use the names Acala (Immovable), as well as Ekallavīra (Sole Hero) and

source: ཁྲོ་ཆེན་གཏུམ་པོ་ཞེས་པ་ཡང་། །
en: Caṇḍa­mahā­roṣaṇa (Great Fierce Angry One)?”

source: ཐབས་དང་ཤེས་རབ་བདག་ཉིད་ཅན། །
en: It is the wisdom and skillful means itself,

source: དེ་ཡང་ཆགས་བྲལ་གྱིས་མི་གཡོ། །
en: And therefore cannot be swayed by dispassion.

source: དེ་ཉིད་ཕྱིར་ན་མི་གཡོར་གྲགས། །
en: “For this very reason is it called Acala—

source: རྡོ་རྗེ་སེམས་དཔའི་རང་བཞིན་ཅན། །
en: One with the nature of Vajrasattva,

source: ཞལ་གཅིག་ཕྱག་གཉིས་ཞི་བ་སྟེ། །
en: Two-armed and single-faced, tranquil,

source: རལ་གྲི་ཞགས་པའི་ཕྱག་དག་ནི། །
en: “Holding a sword and a noose in his two hands,

source: ཤེས་རབ་མར་འཁྱུད་དེ་མཆོག་གོ། །
en: Supremely devoted to embracing the Wisdom,

source: སེམས་དཔའི་སྐྱིལ་ཀྲུང་གིས་བཞུགས་པ། །
en: Sitting in sattvaparyaṅka posture

source: པདྨ་ཟླ་བ་ཉི་གནས་ལ། །
en: On top of a lotus, a moon, and a sun.

source: ལྷ་ཡི་བདེ་བས་ཤིན་ཏུ་གནས། །
en: Abiding happily in divine bliss!

source: དེ་ཕྱིར་འདི་ནི་མི་གཡོར་གསུངས། །
en: It is for this reason that he is called Acala

source: དུས་གསུམ་རྒྱལ་བ་ཀུན་གྱིས་ནི། །
en: All the victorious ones of the three times

source: དེ་ནས་ཀུན་ཏུ་བཟང་པོས་གསོལ་བ།
en: Samantabhadra then said:
